app/controllers/drivers_controller.rb

  def index
      @drivers = Driver.order(created_at: :desc)
---
SELECT "drivers".* FROM "drivers" ORDER BY "drivers"."created_at" DESC

    def create
      @driver = Driver.new(driver_params)

      respond_to do |format|
        if @driver.save
---
INSERT INTO "drivers" ("name", "surname", "date_of_birth", "created_at", "updated_at", "adress") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["surname", "Sultan"], ["date_of_birth", "2019-11-19"], ["created_at", "2019-11-19 11:54:23.854635"], ["updated_at", "2019-11-19 11:54:23.854635"], ["adress", ""]]

    def update
      set-driver
      respond_to do |format|
        if @driver.update(driver_params)
---
UPDATE "drivers" SET "tc" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["tc", 2431432], ["updated_at", "2019-11-22 11:09:31.867651"], ["id", 9]]

      def set_driver
        @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]