app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" ORDER BY "vehicles"."created_at" DESC
---
    def index
        @vehicles = Vehicle.order(created_at: :desc)

INSERT INTO "vehicles" ("name", "code", "vehicle_class", "brand", "model", "model_year", "fuel_capacity", "fuel_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
      def create
        @vehicle = Vehicle.new(vehicle_params)

        respond_to do |format|
          if @vehicle.save

UPDATE "vehicles" SET "name" = $1, "code" = $2, "vehicle_class" = $3, "brand" = $4, "model" = $5, "model_year" = $6, "fuel_capacity" = $7, "fuel_type" = $8, "purchase_date" = $9, "updated_at" = $10 WHERE "vehicles"."id" = $11
---
      def update
        set_vehicle
        respond_to do |format|
          if @vehicle.update(vehicle_params)

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_vehicle
          @vehicle = Vehicle.find(params[:id])